wkDir = "E:\\AllRepo\\R_Crawler" ;   setwd(wkDir);
library( "stringr" ) 
library(RCurl)
library(XML)
library( openxlsx )
library(readxl)
library( rio )
library( stringr )
library(dplyr)
library(flextable)
library(ggplot2)
library(data.table)



#####===== (1) (KDD1) Data Acquisition (-->RR) =====#####

RR = read.csv('new.csv', header = TRUE, sep = ',', fileEncoding = "utf-8" ) 

RR <- filter( RR, sub.author != "" )

RR$gp[ RR$gp == "-" ] = 0
RR$bp[ RR$bp == "-" ] = 0

RR$gp[ RR$gp == "爆" ] = as.integer( 1000 )
RR$bp[ RR$bp == "X" ] = as.integer( 1000 )

RR$sub.gp[ RR$sub.gp == "-" ] = 0
RR$sub.bp[ RR$sub.bp == "-" ] = 0

RR$gp[ is.na( RR$gp ) ] = 0
RR$bp[ is.na( RR$bp ) ] = 0
RR$sub.gp[ is.na( RR$sub.gp ) ] = 0
RR$sub.bp[ is.na( RR$sub.bp ) ] = 0

RR$gp = as.integer( RR$gp ) 
RR$bp = as.integer( RR$bp )
RR$sub.gp = as.integer( RR$sub.gp )
RR$sub.bp = as.integer( RR$sub.bp )

RR$sub.time[ RR$sub.time == ""  ] = NA

RR$nch   = nchar( RR$mainText )

RR$sub.nch   = nchar( RR$sub.Text )

RR$Rdate = as.Date(RR$sub.time)

dim(RR);   head(RR,2)   #-- [1] 13945    13


#   title                                      author                time                   gp bp
# 1 20歲到30歲沒專長的年輕人都在做甚麼工作     shueh201237           2022-07-30 04:18:52    12  0
# 2 20歲到30歲沒專長的年輕人都在做甚麼工作     shueh201237           2022-07-30 04:18:52    12  0
#   mainText 
# 1 每年那麼多大學畢業生一些很專業的工作缺沒有那麼多也不是所有人都做相關科系的工作比較不需要門檻的像是很多工廠 工地也幾乎都沒有年輕人餐飲業也是店員幾乎都是老人的趨勢想問看看這種年紀區間沒特殊專長的人可以分享都在做甚麼樣的工作嗎
# 2 每年那麼多大學畢業生一些很專業的工作缺沒有那麼多也不是所有人都做相關科系的工作比較不需要門檻的像是很多工廠 工地也幾乎都沒有年輕人餐飲業也是店員幾乎都是老人的趨勢想問看看這種年紀區間沒特殊專長的人可以分享都在做甚麼樣的工作嗎
#    sub.author            sub.time                sub.gp sub.bp     sub.Text                                                                                               sub.nch
# 1  dh5987462             2022-07-30 04:50:36     20      0         輪班囉設備工程、產品工程、技術員。學校不會教你組裝業界機台、看良率分析啦！大多數文憑只是張面試門票      49
# 2  qbgeneral             2022-07-30 06:50:47     18      0         就大叔我的觀察有幾種外送員貨運電子廠輪班作業員餐飲超商派遣直銷賣車房仲藍藍路差不多就這樣了              45
# Rdate
# 1 2022-07-30
# 2 2022-07-30


#####===== (2) (KDD2) Data Exploration (RR) =====#####
length(unique(RR$title))         ## -- [1] 2214   RR$title 
length(unique(RR$author))        ## -- [1] 1492   RR$author
length(unique(RR$sub.author))    ## -- [1] 4316   RR$sub.author

range(RR$time,na.rm=T)           ## -- [1] "2013-06-06 14:35:23" "2023-04-20 16:06:01"  range(RR$time)
range(RR$sub.time,na.rm=T)       ## -- [1] "2013-06-06 20:03:47" "2023-04-20 18:30:28"  range(RR$sub.time,na.rm=T)


#####===== (3) (KDD3) Data Transformation (RR-->Ra) =====#####
setDT( RR, key="author" )
Ra = RR[, .(FF=length(unique(sub.time)), MM=sum(sub.nch), D0=min(Rdate), Df=max(Rdate), Sgp=sum( as.integer(sub.gp)), Sbp=sum(as.integer(sub.bp))), by=sub.author];   
Ra$Sgp[ is.na( Ra$Sgp ) ] = 0
Ra$Sbp[ is.na( Ra$Sbp ) ] = 0

dim(Ra);   head(Ra,2)   #-- [1] 4316    7
#    回文作者       回文次數   回文總字數    第一次使用     最後一次使用     gp_sum    bp_sum 
#    sub.author     FF         MM            D0             Df               Sgp       Sbp
# 1: sonysonyson2   7          747           2021-04-03     2022-10-20       14        0
# 2:       o89406   48         3009          2020-11-09     2023-03-31       26        0


range(Ra$FF)   #-- [1]   1   284     回文次數
range(Ra$MM)   #-- [1]   0   109813  回文總字數

range( Ra$Sgp ) #-- [1]   0 855      gp_sum
range( Ra$Sbp ) #-- [1]    0 2136    bp_sum


## 切割回文篇數
Ra$FF0 = cut(Ra$FF, breaks=c( -1,0,1,9,19,39,99, 299 ) );   table(Ra$FF0)
# (-1,0]    (0,1]    (1,9]   (9,19]  (19,39]  (39,99] (99,299] 
# 0          2685     1389      140       66       31        5  


## 切割回文字數
Ra$MM0 = cut(Ra$MM, breaks=c(-1,0,1,99,999,9999,59999, 79999, 99999, 110000 ));   table(Ra$MM0)
# (-1,0]           (0,1]          (1,99]        (99,999]     (999,1e+04]   (1e+04,6e+04]   (6e+04,8e+04]   (8e+04,1e+05] (1e+05,1.1e+05] 
# 11               5            1510            2255             510              21               2               1               1 

## 切割GP
Ra$Sgp0 = cut(Ra$Sgp, breaks=c(-1,0,1,9,19,39,99, 299, 499, 699, 899  ) );   table(Ra$Sgp0)
# (-1,0]     (0,1]     (1,9]    (9,19]   (19,39]   (39,99]  (99,299] (299,499] (499,699] (699,899] 
# 1020         761      1655       386       243       174        67         3         4         3 


## 切割BP
Ra$Sbp0 = cut( Ra$Sbp, breaks=c(-1,0,1,9,19,39,99, 299, 499, 699, 899, 2199 ) );   table(Ra$Sbp0)
# (-1,0]         (0,1]         (1,9]        (9,19]       (19,39]       (39,99]      (99,299]     (299,499]     (499,699]     (699,899] (899,2.2e+03] 
#   4272             0             6            11            12             7             6             1             0             0             1


# year 年分  Y0: min year, Yf: max year 
Ra$Y0 = as.integer( substr(Ra$D0,1,4) )
Ra$Yf = as.integer( substr(Ra$Df,1,4) )
dim(Ra);   head(Ra,2)   #-- [1] 4316   13
# sub.author        FF   MM         D0           Df            Sgp    Sbp     FF0         MM0           Sgp0    Sbp0    Y0    Yf
# 1: sonysonyson2    7   747        2021-04-03   2022-10-20    14       0     (1,9]       (99,999]      (9,19]  (-1,0]  2021  2022
# 2:       o89406   48   3009       2020-11-09   2023-03-31    26       0     (39,99]     (999,1e+04]   (19,39] (-1,0]  2020  2023

#####===== (6) (KDD4) Data Modeling (Ra) =====#####
addmargins( table(Ra$Y0,Ra$Yf) )
#     結束 2013 2014 2015 2016 2017 2018 2019 2020 2021 2022 2023  Sum
# 開始    
# 2013      3    0    0    0    0    0    0    0    0    0    0     3
# 2014      0   10    0    0    1    0    0    0    0    2    4     17
# 2015      0    0   30    1    1    0    0    2    9    3    4     50
# 2016      0    0    0   49    0    0    1    1    7    9   13     80
# 2017      0    0    0    0   31    2    0    2    4    8    9     56
# 2018      0    0    0    0    0   64    3    0    8    9   12     96
# 2019      0    0    0    0    0    0  141    5   27   37   34     244
# 2020      0    0    0    0    0    0    0  240   74   58   58     430
# 2021      0    0    0    0    0    0    0    0 1345  308  183     1836
# 2022      0    0    0    0    0    0    0    0    0  998  139     1137
# 2023      0    0    0    0    0    0    0    0    0    0  367     367
#
# Sum       3   10   30   50   33   66  145  250 1474 1432  823     4316


#####===== (7) (KDD5) start & finall Year Result Interpretation


# (1)  2021年的使用人數突然急遽上升, 240人 -> 1345人, 增加了 >1000 人
#      這個年份剛好是 covid-19 最嚴重影響台灣上班族的時間，可能是因為疫情而讓更多人使用職場版


# (2)  2022年的使用人數突然急遽下降, 1345人 -> 998人
#      這個年份是台灣逐漸解放covid-19也已經發展完整的對應系統(隔離、居家上班)


# (3) 在巴哈上面活動 9 
# sub.author      FF    MM         D0           Df         Sgp   Sbp     FF0           MM0         Sgp0       Sbp0   Y0    Yf
# 1:  edgarfigard 56    12505      2014-12-15   2023-02-08 127   0       (39,99]   (1e+04,6e+04]  (99,299]   (-1,0]  2014  2023
# sort( RR$Rdate[ RR$sub.author == "edgarfigard" ] )
edgarfigard_plot <- ggplot( data.frame( year = sort( substr(RR$Rdate[ RR$sub.author == "edgarfigard" ], 1, 4 ) )), aes(x = year)) + geom_bar()

# 2:      D109424 74    11478      2014-12-05   2023-04-18 171   0       (39,99]   (1e+04,6e+04]  (99,299]   (-1,0]  2014  2023
# sort( RR$Rdate[ RR$sub.author == "D109424" ] )
D109424_plot <- ggplot( data.frame( year = sort( substr(RR$Rdate[ RR$sub.author == "D109424" ], 1, 4 ) )), aes(x = year)) + geom_bar()

# 3:     play1128 58    12445      2014-12-25   2023-04-15 171   0       (39,99]   (1e+04,6e+04]  (99,299]   (-1,0]  2014  2023
# sort( RR$Rdate[ RR$sub.author == "play1128" ] )
play1128_plot <- ggplot( data.frame( year = sort( substr(RR$Rdate[ RR$sub.author == "play1128" ], 1, 4 ) )), aes(x = year)) + geom_bar()

# 4:     konyosam 92    86483      2014-12-03   2023-04-13 543   0       (39,99]   (8e+04,1e+05] (499,699]   (-1,0]  2014  2023
# sort( RR$Rdate[ RR$sub.author == "konyosam" ] )
konyosam_plot <- ggplot( data.frame( year = sort( substr(RR$Rdate[ RR$sub.author == "konyosam" ], 1, 4 ) )), aes(x = year)) + geom_bar()




#####===== (8) (KDD4) Data Modeling (Ra) =====#####
addmargins( table(Ra$Sbp0,Ra$Sgp0) )
#           GP  (-1,0] (0,1] (1,9] (9,19] (19,39] (39,99] (99,299] (299,499] (499,699] (699,899]  Sum
#   BP
# (-1,0]          1019   760  1646    378     239     164       59         1         4         2 4272
# (0,1]              0     0     0      0       0       0        0         0         0         0    0
# (1,9]              1     0     1      2       0       0        2         0         0         0    6
# (9,19]             0     1     4      1       0       4        1         0         0         0   11
# (19,39]            0     0     2      2       2       3        2         1         0         0   12
# (39,99]            0     0     0      2       0       3        2         0         0         0    7
# (99,299]           0     0     2      1       2       0        1         0         0         0    6
# (299,499]          0     0     0      0       0       0        0         1         0         0    1
# (499,699]          0     0     0      0       0       0        0         0         0         0    0
# (699,899]          0     0     0      0       0       0        0         0         0         0    0
# (899,2.2e+03]      0     0     0      0       0       0        0         0         0         1    1
# Sum             1020   761  1655    386     243     174       67         3         4         3 4316

#####===== (9) (KDD5) GP & BP Result Interpretation
# (1) 有超過9成的文章都沒有 BP, 代表這個社群應該蠻友善的
# (2) -- GP 拿最多的人
Ra[ Ra$Sgp == max(Ra$Sgp) ]
# sub.author  FF    MM         D0         Df         Sgp   Sbp   Sbp0      Sgp0        FF0
# qbgeneral   183   22612      2020-11-02 2023-04-13 855   0     (-1,0]    (699,899]   (99,299]
## 總共發表183次文，而且bp是0, 我猜這個人的回應可能讓大家很有共鳴。

# (3) -- 是 BP 拿最多的人
Ra[ Ra$Sbp == max(Ra$Sbp) ]
#   sub.author  FF    MM         D0           Df           Sgp  Sbp            Sbp0            Sgp0       FF0
#   abcgg12     284   32359      2020-02-06   2023-02-04   837  2136           (2e+03,2.2e+03] (699,899]  (99,299]
##  總共發表284次文, 但是gp也不少，我猜這個人可能發了很多篇廢文所以bp才會這麼多，或著是在巴哈裡面認同他的想法大概佔1/3。


#####===== (4) (KDD4) Data Modeling (Ra) =====#####
addmargins( table(Ra$FF0,Ra$MM0) )
#      字數 (-1,0] (0,1] (1,99] (99,999] (999,1e+04] (1e+04,6e+04] (6e+04,8e+04] (8e+04,1e+05] (1e+05,1.1e+05]  Sum
# 篇數
# (-1,0]        0     0      0        0           0             0             0             0               0    0
# (0,1]        11     5   1336     1271          62             0             0             0               0 2685
# (1,9]         0     0    174      948         265             2             0             0               0 1389
# (9,19]        0     0      0       32         105             3             0             0               0  140
# (19,39]       0     0      0        4          58             4             0             0               0   66
# (39,99]       0     0      0        0          20             9             1             1               0   31
# (99,299]      0     0      0        0           0             3             1             0               1    5
#
# Sum          11     5   1510     2255         510            21             2             1               1 4316


Ra[ as.numeric(Ra$MM0)==9 ]; RR[ RR$sub.author == "tt700910" ]
# sub.author  FF     MM         D0         Df Sgp Sbp      FF0             MM0      Sgp0   Sbp0   Y0   Yf
# 1:   tt700910 226 109813 2021-01-02 2023-04-20 696   0 (99,299] (1e+05,1.1e+05] (499,699] (-1,0] 2021 2023


Ra[ as.numeric(Ra$MM0)==2 ] ; RR[ RR$sub.author == "kevin8511429" ] 
# sub.author FF MM         D0         Df Sgp Sbp   FF0   MM0   Sgp0   Sbp0   Y0   Yf
# 1: kevin8511429  1  1 2022-03-05 2022-03-05   0   0 (0,1] (0,1] (-1,0] (-1,0] 2022 2022
# 2:   A161605695  1  1 2021-11-16 2021-11-16   0   0 (0,1] (0,1] (-1,0] (-1,0] 2021 2021
# 3:     b548312b  1  1 2022-01-02 2022-01-02   0   0 (0,1] (0,1] (-1,0] (-1,0] 2022 2022
# 4: Rayduenglish  1  1 2021-09-18 2021-09-18   2   0 (0,1] (0,1]  (1,9] (-1,0] 2021 2021
# 5:  kamisama697  1  1 2022-10-19 2022-10-19   0   0 (0,1] (0,1] (-1,0] (-1,0] 2022 2022
# sub.author            sub.time sub.gp sub.bp sub.Text sub.nch      Rdate
# 1: kevin8511429 2022-03-05 13:36:27      0      0       卡       1 2022-03-05


Ra[ as.numeric(Ra$MM0)==1]; RR[ RR$sub.author == "Z199425504" ] 
# sub.author FF MM         D0         Df Sgp Sbp   FF0    MM0   Sgp0   Sbp0   Y0   Yf
# 1:    kito21602  1  0 2022-02-22 2022-02-22   0   0 (0,1] (-1,0] (-1,0] (-1,0] 2022 2022
# 2: z15987532123  1  0 2022-10-05 2022-10-05   1   0 (0,1] (-1,0]  (0,1] (-1,0] 2022 2022
# 3:  s0963547413  1  0 2023-01-27 2023-01-27   2   0 (0,1] (-1,0]  (1,9] (-1,0] 2023 2023
# 4:      Aa52852  1  0 2023-03-25 2023-03-25   1   0 (0,1] (-1,0]  (0,1] (-1,0] 2023 2023
# 5:      york103  1  0 2022-08-07 2022-08-07   0   0 (0,1] (-1,0] (-1,0] (-1,0] 2022 2022
# 6:     dmicje12  1  0 2023-04-18 2023-04-18   0   0 (0,1] (-1,0] (-1,0] (-1,0] 2023 2023
# 7:   Z199425504  1  0 2022-08-01 2022-08-01  14   0 (0,1] (-1,0] (9,19] (-1,0] 2022 2022
# 8: P09089648kfl  1  0 2022-12-03 2022-12-03   0   0 (0,1] (-1,0] (-1,0] (-1,0] 2022 2022
# 9:    kevin5641  1  0 2021-06-02 2021-06-02   4   0 (0,1] (-1,0]  (1,9] (-1,0] 2021 2021
# 10: sia2006power  1  0 2023-02-22 2023-02-22  13   0 (0,1] (-1,0] (9,19] (-1,0] 2023 2023
# 11:      a901218  1  0 2022-08-02 2022-08-02   2   0 (0,1] (-1,0]  (1,9] (-1,0] 2022 2022



#####===== (5) (KDD5) Result Interpretation
# (1)
# (2)
# (3)




#####===== (9) (KDD4) Data Transformation (RR-->Rt) text analyze =====#####  
setDT( RR, key = "title" )
Rt = RR[, .( tt=unique(mainText), MM=unique( nch ), gp=unique(gp), bp=unique(bp), res=length(sub.author), D0= as.Date(unique(time)) , Df=max(Rdate) ), by=title ]

# year 年分  Y0: min year, Yf: max year 
Rt$Y0 = as.integer( substr(Rt$D0,1,4) )
Rt$Yf = as.integer( substr(Rt$Df,1,4) )

head( Rt, 3 ) ; dim( Rt )
# title
# 1:                                      -
# 2:                                      .
# 3: 20歲到30歲沒專長的年輕人都在做甚麼工作
#
# tt
# 1: 台灣物價比南韓高？韓妞驚：大家怎買得起房子！民視新聞網2022年2月8日影音中心／邱雯馨報導許多台灣民眾認為，南韓的薪資、物價、房價都比台灣來得高，然而實際情況可能並非如此。在台灣念大學的南韓YouTuber小鉉透過影片分享台韓文化差異，以及她在台灣生活的心得，坦言南韓物價的確不低，而台灣蔬菜、水果也確實比南韓便宜又好吃，但除此之外，衣服、鞋子與3C電子產品價格，跟南韓相比，其實並不算便宜，讓她不禁想問：「大家怎麼買得起房子？」小鉉說，2020年南韓人平均年薪為117萬元新台幣，雖然看似月薪很高，但物價、房價普遍偏高，常有住在首爾的年輕人發文抱怨入不敷出，根本無法存錢。而與南韓相比，台灣的物價確實普遍較低，但也並非什麼都便宜，小鉉便觀察到台灣除了蔬菜、水果之外，台灣日常所需的衣服、鞋子與3C電子產品其實售價幾乎都比南韓貴，並沒有比較便宜，讓身為外國人的她忍不住問：「大家怎麼買得起房子？」引發許多台灣網友共鳴「台灣的貧富差距比韓國大，在台灣一般被受聘的人賺到的錢都很少」、「水果蔬菜便宜是因為台灣自產比較多」、「台灣雖然薪水沒有韓國高，但購買力好像比韓國好」。https://reurl.cc/Y8d7ND----------------------------------------------------------------------------------------------------------------------------韓國人基本薪資 每月4萬台幣 每小時210台幣台灣人基本薪資 每月2萬7台幣 每小時176台幣人家薪資接近1.5倍物價也該1.5倍才跟台灣物價打平韓國人有說到韓國物價跟台灣差不多這是很扯的甚至有很多東西　韓國更便宜我只能說國家方向不同台灣的國家方向是炒房韓國的國家方向是生產力
# 2: 已經離開這行業了分享給各位系統保全    (也有人稱作電子保全)颱風天也要在外面跑新聞也有報過颱風在路上被樹倒砸死的颱風扯斷電纜在馬路上電死的薪水少  工時長每天13小時   工作22~24天總時數312小時薪水36000~3800038000元/312小時= 121時薪[系統保全]   跟  [一般大樓保全]  不同[大樓保全]經常在室內 [系統保全]經常在戶外  幾乎跟郵差沒兩樣  一天跑好幾十家客戶  一直處在駕駛中的狀態我家巷口手搖店員時薪168致死率？？？非常低颱風天致死率那麼高拿121時薪是不是很可憐？又累又危險時薪還很少如果時薪很低但是像大樓保全那樣閒就算了系統保全時薪很低又很忙  還很危險真的好慘這工作
# 3: 每年那麼多大學畢業生一些很專業的工作缺沒有那麼多也不是所有人都做相關科系的工作比較不需要門檻的像是很多工廠 工地也幾乎都沒有年輕人餐飲業也是店員幾乎都是老人的趨勢想問看看這種年紀區間沒特殊專長的人可以分享都在做甚麼樣的工作嗎
#
#    MM     gp    bp    res   D0            Df            Y0      Yf
# 1: 770    23    0     6     2023-02-28    2023-03-01    2023    2023
# 2: 313    5     0     3     2022-01-09    2022-01-13    2022    2022
# 3: 112    12    0     19    2022-07-30    2022-08-02    2022    2022
# [1] 2216    8



range(Rt$MM)   #-- [1] 0   12499  主文總字數範圍

range( Rt$res )   #-- [1]  1   19  回文篇數範圍

range( Rt$gp ) #-- [1]   0 1000    gp

range( Rt$bp ) #-- [1]   0 156    bp


## 切割回文篇數
Rt$res0 = cut(Rt$res, breaks=c( -1,0,1,9,15,20 ) );   table(Rt$res0)
# (-1,0]   (0,1]   (1,9]  (9,15] (15,20] 
#      0     376    1335     278     227 


## 切割回文字數
Rt$MM0 = cut(Rt$MM, breaks=c( -1,0,1,99,999,1999,3999,7999,9999, 19999 ) ) ;   table(Rt$MM0)
# (-1,0]    (0,1]        (1,99]      (99,999]   (999,2e+03] (2e+03,4e+03] (4e+03,8e+03] (8e+03,1e+04] (1e+04,2e+04] 
#      2        0           421          1555           160            52            21             4             1 


## 切割GP
Rt$gp0 = cut(Rt$gp, breaks=c(-1,0,1,9,19,39,99, 299, 499, 699, 999, 1099  ) );   table(Rt$gp0)
# (-1,0]         (0,1]         (1,9]        (9,19]       (19,39]       (39,99]      (99,299]     (299,499]     (499,699]     (699,999]  (999,1.1e+03] 
#    600           408           771           141           122            83            69            12             6             3          1


## 切割BP
Rt$bp0 = cut( Rt$bp, breaks=c(-1,0,1,9,19,39,99, 199 ) );   table(Rt$bp0)
# (-1,0]    (0,1]    (1,9]   (9,19]  (19,39]  (39,99] (99,199] 
#   1942        0       70       57       78       68        1 



addmargins( table(Rt$Y0,Rt$Yf) )
#      2015 2016 2017 2018 2019 2020 2021 2022 2023  Sum
# 2013    2    1    0    0    0    0    0    0    0    3
# 2015    3    0    0    0    0    0    0    1    0    4
# 2016    0    5    0    0    0    0    0    0    1    6
# 2017    0    0    4    1    0    0    0    0    0    5
# 2018    0    0    0    4    0    0    3    3    3   13
# 2019    0    0    0    0   10    2   13    9    0   34
# 2020    0    0    0    0    0   20   23   29    8   80
# 2021    0    0    0    0    0    0  822   53   10  885
# 2022    0    0    0    0    0    0    0  859   35  894
# 2023    0    0    0    0    0    0    0    0  292  292
# Sum     5    6    4    5   10   22  861  954  349 2216


addmargins( table(Rt$gp0,Rt$bp0) )
#               (-1,0] (0,1] (1,9] (9,19] (19,39] (39,99] (99,199]  Sum
# (-1,0]           563     0     4     10      14       9        0  600
# (0,1]            369     0     5      9      15      10        0  408
# (1,9]            670     0    24     15      25      37        0  771
# (9,19]           118     0     9      4       7       3        0  141
# (19,39]           97     0    11      3       6       5        0  122
# (39,99]           65     0     8      5       2       2        1   83
# (99,299]          47     0     6      6       8       2        0   69
# (299,499]          8     0     2      2       0       0        0   12
# (499,699]          3     0     1      1       1       0        0    6
# (699,999]          1     0     0      2       0       0        0    3
# (999,1.1e+03]      1     0     0      0       0       0        0    1
# Sum             1942     0    70     57      78      68        1 2216









#####===== (A2) 主題數據框到主題價值模型(Topic Value Model) (Pv->Pv$chCount0,Pv$nDay0) =====#####  
setDT(RR, key = "title") 
Pv = RR[, .(title=unique(title), postNo=length(sub.time), D0=min(sub.time), Df=max(sub.time), Nauthor=length(unique(sub.author)), 
            chCount=sum(nch,na.rm=T)), by=title];   
Pv$postNo0 = cut(Pv$postNo, breaks=c(0,1,9,99,999,7999));   table(Pv$postNo0)
Pv$chCount0 = cut(Pv$chCount, breaks=c(-1,0,9,99,999,9999,99999,999999));    table(Pv$chCount0)
Pv$nDay = as.Date(Pv$Df)-as.Date(Pv$D0);   range(Pv$nDay)   #-- 0 4253
Pv$nDay0 = cut(as.numeric(Pv$nDay), breaks=c(-1,0,7,30,100,400,1200,4300));  table(Pv$nDay0)
dim(Pv);   head(Pv,3)   #-- [1] 2214   11
addmargins( table(Pv$nDay0, Pv$chCount0) )
#  nDay0\chCount0   (-1,0] (0,9] (9,99] (99,999] (999,1e+04] (1e+04,1e+05] (1e+05,1e+06]  Sum
# (-1,0]                 0     1    119      414         111            12             0  657   #-- 一日話題
# (0,7]                  1     1     20      406         563            63             1 1055   #-- 一週
# (7,30]                 0     0      3       72         137            32             1  245   #-- 一月
# (30,100]               0     0      0       22          39            25             1   87   #-- 三月
# (100,400]              1     0      1       18          39            18             2   79   #-- 一年
# (400,1.2e+03]          0     0      0       12          41            26             1   80   #-- 三年
# (1.2e+03,4.3e+03]      0     0      0        1           4             6             0   11   #-- 逾三年
# Sum                    2     2    143      945         934           182             6 2214
#                            數十字話題  數百字..    數千字..     數萬字..      數十萬字..